zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
#define PAYLOAD_LEN                     (104)

#if (LED_COUNT >= 3)
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED1)
#define LED_DATA                        (LED2)
#elif (LED_COUNT == 2)
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED0)
#define LED_DATA                        (LED1)
#else
#define LED_START                       (LED0)
#define LED_NWK_SETUP                   (LED0)
#define LED_DATA                        (LED0)
#define LED_DATA                        (LED0)
#endif

/* === GLOBALS ============================================================= */

/* This structure stores the short and extended address of the coordinator. */
static wpan_addr_spec_t coord_addr_spec;

/* This variable counts the number of received broadcast data frames. */
static uint32_t bc_rx_cnt;

/* This variable counts the number of received indirect data frames. */
static uint32_t indirect_rx_cnt;

/** This variable stores the current state of the node. */
static app_state_t app_state = APP_IDLE;

/** This array stores the current msdu payload. */
static uint8_t msdu_payload[PAYLOAD_LEN];

static uint8_t current_channel;
static uint8_t current_channel_page;
static uint32_t channels_supported;

static uint8_t APP_TIMER;

/* === PROTOTYPES ========================================================== */
/**
 * @brief Callback function indicating network search
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void network_search_indication_cb(void *parameter);

/**
 * @brief Callback function for switching off the LED after data reception
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void rx_data_led_off_cb(void *parameter);

/** Alert to indicate something has gone wrong in the application */
static void app_alert(void);

/* === IMPLEMENTATION ====================================================== */

/**
 * @brief Main function of the device application
 */
int main(void)
{
	/* Initialize the board.
	 * The board-specific conf_board.h file contains the configuration of
	 * the board initialization.
	 */
	irq_initialize_vectors();
	board_init();
	sysclk_init();

	sw_timer_init();

	if(MAC_SUCCESS != wpan_init())
	{
		app_alert();
	}

    /* Initialize LEDs. */
    LED_On(LED_START);         // indicating application is started
    LED_Off(LED_NWK_SETUP);    // indicating network is started
    LED_Off(LED_DATA);         // indicating data transmission

	cpu_irq_enable();

#ifdef SIO_HUB
    /* Initialize the serial interface used for communication with terminal program. */
    sio2host_init();

    /* To Make sure the Hyper Terminal to the System */
	sio2host_getchar();

    printf("\nBeacon_Application\r\n\n");
    printf("\nDevice\r\n\n");
#endif

	sw_timer_get_id(&APP_TIMER);

	wpan_mlme_reset_req(true);

	while (true)
	{
		wpan_task();
	}
}


#if defined(ENABLE_TSTAMP)

/*
 * Callback function usr_mcps_data_conf
 *
 * @param msduHandle  Handle of MSDU handed over to MAC earlier
 * @param status      Result for requested data transmission request
 * @param Timestamp   The time, in symbols, at which the data were transmitted
 *                    (only if timestamping is enabled).
 *
 */
void usr_mcps_data_conf(uint8_t msduHandle,
                        uint8_t status,
                        uint32_t Timestamp)
#else
void usr_mcps_data_conf(uint8_t msduHandle,
                        uint8_t status)
#endif  /* ENABLE_TSTAMP */
{
	
}

/*
 * @brief Callback function usr_mcps_data_ind
 *
 * @param SrcAddrSpec      Pointer to source address specification
 * @param DstAddrSpec      Pointer to destination address specification
 * @param msduLength       Number of octets contained in MSDU
 * @param msdu             Pointer to MSDU
 * @param mpduLinkQuality  LQI measured during reception of the MPDU
 * @param DSN              DSN of the received data frame.
 * @param Timestamp        The time, in symbols, at which the data were received.
 *                         (only if timestamping is enabled).
 */
void usr_mcps_data_ind(wpan_addr_spec_t *SrcAddrSpec,
                       wpan_addr_spec_t *DstAddrSpec,
                       uint8_t msduLength,
                       uint8_t *msdu,
                       uint8_t mpduLinkQuality,
#ifdef ENABLE_TSTAMP
                       uint8_t DSN,
                       uint32_t Timestamp)
#else
                       uint8_t DSN)
#endif  /* ENABLE_TSTAMP */
{
#ifdef SIO_HUB
    char sio_array[255];
#endif

    if (DstAddrSpec->Addr.short_address == BROADCAST)
    {
        bc_rx_cnt++;
#ifdef SIO_HUB
        printf("Broadcast ");
        sprintf(sio_array, "Frame received: %" PRIu32 "\r\n", bc_rx_cnt);
#endif
    }
    else
    {
        indirect_rx_cnt++;
#ifdef SIO_HUB
        printf("Indirect Data ");
        sprintf(sio_array, "Frame received: %" PRIu32 "\r\n", indirect_rx_cnt);
#endif
    }
#ifdef SIO_HUB
    printf(sio_array);
#endif

    /*
     * Dummy data has been received successfully.
     * Application code could be added here ...
     */
    LED_On(LED_DATA);

    /* Start a timer switching off the LED. */
    sw_timer_start(APP_TIMER,
                    500000,
                    SW_TIMEOUT_RELATIVE,
                    (FUNC_PTR)rx_data_led_off_cb,
                    NULL);

    /* Keep compiler happy. */
    SrcAddrSpec = SrcAddrSpec;
    DstAddrSpec = DstAddrSpec;
    msduLength = msduLength;
    msdu = msdu;
    mpduLinkQuality = mpduLinkQuality;
    DSN = DSN;
#ifdef ENABLE_TSTAMP
    Timestamp = Timestamp;
#endif  /* ENABLE_TSTAMP */
}


#if ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1))
/*
 * Callback function usr_mcps_purge_conf
 *
 * @param msduHandle           Handle (id) of MSDU to be purged.
 * @param status               Result of requested purge operation.
 *
 * @return void

 */
void usr_mcps_purge_conf(uint8_t msduHandle,
                         uint8_t status)
{
	
