zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
}
#endif  /* ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1)) */


#if (MAC_ASSOCIATION_REQUEST_CONFIRM == 1)

/*
 * @brief Callback function usr_mlme_associate_conf
 *
 * @param AssocShortAddress    Short address allocated by the coordinator
 * @param status               Result of requested association operation
 */
void usr_mlme_associate_conf(uint16_t AssocShortAddress,
                             uint8_t status)
{
    if (status == MAC_SUCCESS)
    {
#ifdef SIO_HUB
        printf("Connected to beacon-enabled network\r\n");
#endif
        /* Set proper state of application. */
        app_state = APP_DEVICE_RUNNING;

        /* Stop timer used for search indication */
        sw_timer_stop(APP_TIMER);

        LED_On(LED_NWK_SETUP);
    }
    else
    {
        LED_Off(LED_NWK_SETUP);

        /* Set proper state of application. */
        app_state = APP_IDLE;

        /* Something went wrong; restart. */
        wpan_mlme_reset_req(true);
    }

    /* Keep compiler happy. */
    AssocShortAddress = AssocShortAddress;
}
#endif  /* (MAC_ASSOCIATION_REQUEST_CONFIRM == 1) */


#if (MAC_ASSOCIATION_INDICATION_RESPONSE == 1)

/*
 * @brief Callback function usr_mlme_associate_ind
 *
 * @param DeviceAddress         Extended address of device requesting association
 * @param CapabilityInformation Capabilities of device requesting association
 */
void usr_mlme_associate_ind(uint64_t DeviceAddress,
                            uint8_t CapabilityInformation)
{
    /* Keep compiler happy. */
	DeviceAddress = DeviceAddress;
    CapabilityInformation = CapabilityInformation;
}
#endif  /* (MAC_ASSOCIATION_INDICATION_RESPONSE == 1) */


#if (MAC_BEACON_NOTIFY_INDICATION == 1)

/*
 * Callback function usr_mlme_beacon_notify_ind
 *
 * @param BSN            Beacon sequence number.
 * @param PANDescriptor  Pointer to PAN descriptor for received beacon.
 * @param PendAddrSpec   Pending address specification in received beacon.
 * @param AddrList       List of addresses of devices the coordinator has pending data.
 * @param sduLength      Length of beacon payload.
 * @param sdu            Pointer to beacon payload.
 */
void usr_mlme_beacon_notify_ind(uint8_t BSN,
                                wpan_pandescriptor_t *PANDescriptor,
                                uint8_t PendAddrSpec,
                                uint8_t *AddrList,
                                uint8_t sduLength,
                                uint8_t *sdu)
{
    if (APP_SCAN_DONE == app_state)
    {
        /* Set proper state of application. */
        app_state = APP_ASSOC_IN_PROGRESS;

        /*
         * Associate to our coordinator.
         * Use: bool wpan_mlme_associate_req(uint8_t LogicalChannel,
         *                                   uint8_t ChannelPage,
         *                                   wpan_addr_spec_t *CoordAddrSpec,
         *                                   uint8_t CapabilityInformation);
         * This request will cause a mlme associate confirm message ->
         * usr_mlme_associate_conf.
         */
        wpan_mlme_associate_req(current_channel,
                                current_channel_page,
                                &coord_addr_spec,
                                WPAN_CAP_ALLOCADDRESS);
    }
    else if (APP_DEVICE_RUNNING == app_state)
    {
        /* This is the standard portion once the node is associated
         * with the application.
         */
        /*
         * Extract the beacon payload from our coordinator and feed it back
         * to the coordiantor via a data frame.
         */
        /* Use: bool wpan_mcps_data_req(uint8_t SrcAddrMode,
         *                              wpan_addr_spec_t *DstAddrSpec,
         *                              uint8_t msduLength,
         *                              uint8_t *msdu,
         *                              uint8_t msduHandle,
         *                              uint8_t TxOptions);
         *
         * This request will cause a mcps data confirm message ->
         * usr_mcps_data_conf
         */
        if (sduLength > PAYLOAD_LEN)
        {
            sduLength = PAYLOAD_LEN;
        }

        /* Copy payload from beacon frame. */
        memcpy(&msdu_payload, sdu, sduLength);

        uint8_t src_addr_mode = WPAN_ADDRMODE_SHORT;
        static uint8_t msdu_handle = 0;

        msdu_handle++;              // Increment handle
        wpan_mcps_data_req(src_addr_mode,
                           &coord_addr_spec,
                           sduLength,
                           &msdu_payload[0],
                           msdu_handle,
                           WPAN_TXOPT_ACK);

#ifdef SIO_HUB
        {
            static uint32_t rx_cnt;
            char sio_array[255];  /* sizeof(uint32_t) + 1 */

            /* Print received payload. */
            rx_cnt++;
            sprintf(sio_array, "Rx beacon payload (%" PRIu32 "): ", rx_cnt);
            printf(sio_array);

            /* Set last element to 0. */
            if (sduLength == PAYLOAD_LEN)
            {
                msdu_payload[PAYLOAD_LEN - 1] = '\0';
            }
            else
            {
                msdu_payload[sduLength] = '\0';
            }
            printf((char *)msdu_payload);
            printf("\r\n");
        }
#endif  /* SIO_HUB */
    }

    /* Keep compiler happy. */
    BSN = BSN;
    PANDescriptor = PANDescriptor;
    PendAddrSpec = PendAddrSpec;
    AddrList = AddrList;
}
#endif  /* (MAC_BEACON_NOTIFY_INDICATION == 1) */


#if ((MAC_ORPHAN_INDICATION_RESPONSE == 1) || (MAC_ASSOCIATION_INDICATION_RESPONSE == 1))

/*
 * @brief Callback function usr_mlme_comm_status_ind
 *
 * @param SrcAddrSpec      Pointer to source address specification
 * @param DstAddrSpec      Pointer to destination address specification
 * @param status           Result for related response operation
 */
void usr_mlme_comm_status_ind(wpan_addr_spec_t *SrcAddrSpec,
                              wpan_addr_spec_t *DstAddrSpec,
                              uint8_t status)
{
    if (status == MAC_SUCCESS)
    {
        /*
         * Now the association of the device has been successful and its
         * information, like address, could  be stored.
         * But for the sake of simple handling it has been done
         * during assignment of the short address within the function
         * assign_new_short_addr()
         */
    }

    /* Keep compiler happy. */
    SrcAddrSpec = SrcAddrSpec;
    DstAddrSpec = DstAddrSpec;
}
#endif  /* ((MAC_ORPHAN_INDICATION_RESPONSE == 1) || (MAC_ASSOCIATION_INDICATION_RESPONSE == 1)) */


