zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
                /*
                 * Set the PAN-Id of the scanned network.
                 * This is required in order to perform a proper sync
                 * before assocation.
                 * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
                 *                             void *PIBAttributeValue);
                 *
                 * This request leads to a set confirm message -> usr_mlme_set_conf
                 */
                uint16_t pan_id;
                pan_id = DEFAULT_PAN_ID;
                wpan_mlme_set_req(macPANId, &pan_id);

                return;
            }

            /* Get the next PAN descriptor. */
            coordinator++;
        }

        /*
         * If here, the result list does not contain our expected coordinator.
         * Let's scan again.
         */
        wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
                           SCAN_CHANNEL,
                           SCAN_DURATION_SHORT,
                           current_channel_page);
    }
    else if (status == MAC_NO_BEACON)
    {
        /*
         * No beacon is received; no coordiantor is located.
         * Scan again, but used longer scan duration.
         */
        wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
                           SCAN_CHANNEL,
                           SCAN_DURATION_LONG,
                           current_channel_page);
    }
    else
    {
        /* Set proper state of application. */
        app_state = APP_IDLE;

        /* Something went wrong; restart. */
        wpan_mlme_reset_req(true);
    }

    /* Keep compiler happy. */
    ScanType = ScanType;
    ChannelPage = ChannelPage;
    UnscannedChannels = UnscannedChannels;
}
#endif

/*
 * @brief Callback function usr_mlme_set_conf
 *
 * @param status        Result of requested PIB attribute set operation
 * @param PIBAttribute  Updated PIB attribute
 */
void usr_mlme_set_conf(uint8_t status,
                       uint8_t PIBAttribute)
{
    if ((status == MAC_SUCCESS) && (PIBAttribute == macPANId))
    {
        /*
         * Set the Coordinator Short Address of the scanned network.
         * This is required in order to perform a proper sync
         * before assocation.
         */
        wpan_mlme_set_req(macCoordShortAddress, &coord_addr_spec.Addr);
    }
    else if ((status == MAC_SUCCESS) && (PIBAttribute == macCoordShortAddress))
    {
        /*
         * Sync with beacon frames from our coordinator.
         * Use: bool wpan_mlme_sync_req(uint8_t LogicalChannel,
         *                              uint8_t ChannelPage,
         *                              bool TrackBeacon);
         *
         * This does not lead to an immediate reaction.
         *
         * In case we receive beacon frames from our coordinator including
         * a beacon payload, this is indicated in the callback function
         * usr_mlme_beacon_notify_ind().
         *
         * In case the device cannot find its coordinator or later looses
         * synchronization with its parent, this is indicated in the
         * callback function usr_mlme_sync_loss_ind().
         */
        wpan_mlme_sync_req(current_channel,
                           current_channel_page,
                           1);
    }
    else
    {
        /* Set proper state of application. */
        app_state = APP_IDLE;

        /* Something went wrong; restart. */
        wpan_mlme_reset_req(true);
    }
}


#if (MAC_START_REQUEST_CONFIRM == 1)
void usr_mlme_start_conf(uint8_t status)
{

}
#endif  /* (MAC_START_REQUEST_CONFIRM == 1) */

/*
 * Callback function usr_mlme_sync_loss_ind
 *
 * @param LossReason     Reason for synchronization loss.
 * @param PANId          The PAN identifier with which the device lost
 *                       synchronization or to which it was realigned.
 * @param LogicalChannel The logical channel on which the device lost
 *                       synchronization or to which it was realigned.
 * @param ChannelPage    The channel page on which the device lost
 *                       synchronization or to which it was realigned.
 */
void usr_mlme_sync_loss_ind(uint8_t LossReason,
                            uint16_t PANId,
                            uint8_t LogicalChannel,
                            uint8_t ChannelPage)
{
    /*
     * Once we lost sync this the coordinator we need to re-sync.
     * Since we the network parameter are not supposed ot change,
     * use the already known parameters form our coordinator.
     */
    wpan_mlme_sync_req(LogicalChannel,
                       ChannelPage,
                       1);

    /* Keep compiler happy. */
    LossReason = LossReason;
    PANId = PANId;
}

/* Alert to indicate something has gone wrong in the application */
static void app_alert(void)
{
    while (1)
    {
		#if LED_COUNT > 0
		LED_Toggle(LED0);
		#endif

		#if LED_COUNT > 1
		LED_Toggle(LED1);
		#endif

		#if LED_COUNT > 2
		LED_Toggle(LED2);
		#endif

		#if LED_COUNT > 3
		LED_Toggle(LED3);
		#endif

		#if LED_COUNT > 4
		LED_Toggle(LED4);
		#endif

		#if LED_COUNT > 5
		LED_Toggle(LED5);
		#endif

		#if LED_COUNT > 6
		LED_Toggle(LED6);
		#endif

		#if LED_COUNT > 7
		LED_Toggle(LED7);
		#endif
		delay_us(0xFFFF);
	}
}

/*
 * @brief Callback function indicating network search
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void network_search_indication_cb(void *parameter)
{
    LED_Toggle(LED_NWK_SETUP);

    /* Re-start timer again. */
    sw_timer_start(APP_TIMER,
                    500000,
                    SW_TIMEOUT_RELATIVE,
                    (FUNC_PTR)network_search_indication_cb,
                    NULL);

    parameter = parameter;    /* Keep compiler happy. */
}

/*
 * @brief Callback function for switching off the LED after data reception
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void rx_data_led_off_cb(void *parameter)
{
    LED_Off(LED_DATA);

    parameter = parameter;    /* Keep compiler happy. */
}
